import json

# Текст, который мы хотим сохранить
new_description = """двухсоставной короб с терморазрывом, толщина 143 мм, с широким наличником, металл 1,4 мм с ППП
первый контур уплотнителя по периметру короба
второй контур уплотнителя по периметру короба
третий контур уплотнителя по периметру короба
петли на опорных подшипниках 3 шт.
противосъёмные ригели 2 шт.
механизм регулировки притвора полотна
двухсоставное полотно: лицевая часть из цельногнутого металла 1,4 мм с ППП, внутренняя часть из полимерного материала, толщина 104 мм
внутренняя декоративная панель MДФ 10 мм
дополнительный слой тепло и звукоизоляции ХДФ 3,2 мм
слой тепло-звукоизолирующего материала - пенополистирол
слой тепло-звукоизолирующего материала - базальтовая плита
основной лист металла 1,4 мм с ППП
адгезионное циркониевое покрытие
порошково-полимерное покрытие
накладной порог из нержавеющей стали
ручка Н-0593
декоративная накладка на ключевину замка с закрытыми шторками"""

# Открываем базу и обновляем описание у первой двери
with open('doors.json', 'r', encoding='utf-8') as f:
    doors = json.load(f)

for door in doors:
    if door['id'] == 1:
        door['description'] = new_description
        break

with open('doors.json', 'w', encoding='utf-8') as f:
    json.dump(doors, f, ensure_ascii=False, indent=4)

print("Описание для первой двери успешно обновлено!")